#!/bin/bash

echo "================================================="
echo "로컬배포를 시작합니다."
echo "================================================="
set -e

echo "================================================="
echo "Back-end 모듈을 빌드합니다..."
echo "================================================="
./back/gradlew -p ./back clean bootJar

echo "================================================="
echo "Front-end 모듈을 빌드합니다..."
echo "================================================="
npm --prefix ./front npm build

echo "================================================="
echo "Docker Compose를 사용하여 전체 시스템을 실행합니다..."
echo "================================================="
docker-compose -f ./infra/docker-compose-deploy-local.yml up --build -d

# 사용하지 않는 이미지 정리
docker image prune -f

echo "================================================="
echo "로컬배포가 완료되었습니다."
echo "================================================="